app/controllers/users_controller.rb

  def index
    if params[:search].present?
      @search_attr = params[:search]
      @users = User.near(params[:search], 2)
      @search = Geocoder.coordinates(params[:search])
    else
      @users = User.all
---
SELECT users.*, (69.09332411348201 * ABS(users.latitude - 28.6270824) * 0.7071067811865475) + (59.836573914187355 * ABS(users.longitude - 77.1435687) * 0.7071067811865475) AS distance, CASE WHEN (users.latitude >= 28.6270824 AND users.longitude >= 77.1435687) THEN  45.0 WHEN (users.latitude <  28.6270824 AND users.longitude >= 77.1435687) THEN 135.0 WHEN (users.latitude <  28.6270824 AND users.longitude <  77.1435687) THEN 225.0 WHEN (users.latitude >= 28.6270824 AND users.longitude <  77.1435687) THEN 315.0 END AS bearing FROM "users" WHERE (users.latitude BETWEEN 28.598136043377828 AND 28.65602875662217 AND users.longitude BETWEEN 77.11059104278922 AND 77.17654635721078)  ORDER BY distance ASC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "sourav "], ["address", "katwariya saria ,new delhi , india"], ["created_at", "2015-07-26 19:04:32.352987"], ["updated_at", "2015-07-26 19:04:32.352987"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "address" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["address", "inderpuri , new delhi"], ["updated_at", "2015-07-26 19:05:15.619044"], ["id", 2]]

    def set_user
      @user = User.find(params[:id])
---
SELECT users.*, (69.09332411348201 * ABS(users.latitude - 36.1699412) * 0.7071067811865475) + (59.836573914187355 * ABS(users.longitude - -115.1398296) * 0.7071067811865475) AS distance, CASE WHEN (users.latitude >= 36.1699412 AND users.longitude >= -115.1398296) THEN  45.0 WHEN (users.latitude <  36.1699412 AND users.longitude >= -115.1398296) THEN 135.0 WHEN (users.latitude <  36.1699412 AND users.longitude <  -115.1398296) THEN 225.0 WHEN (users.latitude >= 36.1699412 AND users.longitude <  -115.1398296) THEN 315.0 END AS bearing FROM "users" WHERE (users.latitude BETWEEN 36.02520941688915 AND 36.314672983110846 AND users.longitude BETWEEN -115.31911506159004 AND -114.96054413840996 AND users.id != 12)  ORDER BY distance ASC